app/views/quiz/ask.html.erb

			<ol>
				<% @question.answers.each do |a| %>
---
SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = ?  [["question_id", 2]]