app/views/answers/_form.html.erb

    <%= f.label :question_id, "Вопрос" %><br>
    <%= f.collection_select :question_id, Question.all, :id, :content %>
---
SELECT "questions".* FROM "questions"