app/controllers/answers_controller.rb

  def create
    @answer = Answer.new(answer_params)

    respond_to do |format|
      if @answer.save
---
INSERT INTO "answers" ("content", "created_at", "is_correct", "question_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Answ 5"], ["created_at", "2014-12-25 10:25:30.573280"], ["is_correct", "t"], ["question_id", 9], ["updated_at", "2014-12-25 10:25:30.573280"]]

  def update
    respond_to do |format|
      if @answer.update(answer_params)
---
UPDATE "answers" SET "content" = ?, "is_correct" = ?, "updated_at" = ? WHERE "answers"."id" = 5  [["content", "Answ 1"], ["is_correct", "f"], ["updated_at", "2014-12-25 10:26:04.122844"]]