app/controllers/quiz_controller.rb

SELECT  "questions".* FROM "questions"  LIMIT 1
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 2]]
---
  def ask
  	#Выводим рандомные вопросы
  	question_ids = Question.ids
  	r = Random.rand(question_ids.count)
  	@question = Question.find(question_ids[r])

SELECT  "answers".* FROM "answers"  WHERE "answers"."id" = ? LIMIT 1  [["id", 1]]
---
  def result
  	@answer = Answer.find(params[:answer_id])

SELECT  "users".* FROM "users"  WHERE "users"."login" IS NULL LIMIT 1
INSERT INTO "users" ("created_at", "login", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-12-24 10:40:53.195208"], ["login", ""], ["updated_at", "2014-12-24 10:40:53.195208"]]
---
  def signup
  	@user = User.find_by(login: params["login"])
  	if	@user == nil
  		new_user = User.create(login: params["login"], password: params["password"])

SELECT  "users".* FROM "users"  WHERE "users"."login" = 'PSimakov1409' AND "users"."password" IS NULL LIMIT 1
---
  def signin
  	user = User.find_by(login: params["login"], password: params["password"])