app/controllers/users_controller.rb

	def create
		@user = User.find_by(login: params["login"])
  				if	@user == nil
	  				new_user = User.create(login: params["login"], password: params["password"])
---
SELECT  "users".* FROM "users"  WHERE "users"."login" = '123' LIMIT 1
INSERT INTO "users" ("created_at", "login", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-12-25 11:44:26.863518"], ["login", "123"], ["updated_at", "2014-12-25 11:44:26.863518"]]